Autodesk.Revit.DB.MaterialNode
This class represents a change of material during a model-exporting process.
Remarks:
Output nodes following this node are to be assumed using the material.
The material remains in effect until another material node is sent to the output.
See also: Autodesk.Revit.DB.IExportContext.OnMaterial(Autodesk.Revit.DB.MaterialNode).
Since:
2014